<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"></ul></div>

HOME#10

In [249]:
import sqlite3
import pandas as pd

In [250]:
con = sqlite3.connect(':memory:')

In [251]:
table_names = [
    'Categories',   # –∫–∞—Ç–µ–≥–æ—Ä–∏–∏ —Ç–æ–≤–∞—Ä–æ–≤
    'Customers',    # –∑–∞–∫–∞–∑—á–∏–∫–∏
    'Employees',    # —Å–æ—Ç—Ä—É–¥–Ω–∏–∫–∏
    'OrderDetails', # –¥–µ—Ç–∞–ª–∏ –∑–∞–∫–∞–∑–æ–≤
    'Orders',       # –∑–∞–∫–∞–∑—ã
    'Products',     # —Ç–æ–≤–∞—Ä—ã
    'Shippers',     # –ø–µ—Ä–µ–≤–æ–∑—á–∏–∫–∏
    'Suppliers',    # –ø–æ—Å—Ç–∞–≤—â–∏–∫–∏
]

In [253]:
for table in table_names:
    data = pd.read_csv(f'{table}.csv', sep = ';')
    data.to_sql(table, con, index=False, if_exists='replace')

In [254]:
tasks = 0

**–í—Å–µ –∑–∞–¥–∞–Ω–∏—è –Ω—É–∂–Ω–æ –≤—ã–ø–æ–ª–Ω–∏—Ç—å —Ç–æ–ª—å–∫–æ —Å –ø–æ–º–æ—â—å—é sql**

**_1. –í—ã–±–µ—Ä–∏—Ç–µ –∑–∞–∫–∞–∑—á–∏–∫–æ–≤ –∏–∑ –ì–µ—Ä–º–∞–Ω–∏–∏, –§—Ä–∞–Ω—Ü–∏–∏ –∏ –ú–∞–¥—Ä–∏–¥–∞, –≤—ã–≤–µ–¥–∏—Ç–µ –∏—Ö –Ω–∞–∑–≤–∞–Ω–∏–µ, —Å—Ç—Ä–∞–Ω—É –∏ –∞–¥—Ä–µ—Å._**

In [255]:
tasks+=1
pd.read_sql(
    '''
    SELECT CustomerName AS –ù–∞–∑–≤–∞–Ω–∏–µ,
    Country AS –°—Ç—Ä–∞–Ω–∞,
    Address AS –ê–¥—Ä–µ—Å 
    FROM Customers
    WHERE Country='Germany' OR Country='France' OR City='Madrid'
    ''',
    con,
)

,–ù–∞–∑–≤–∞–Ω–∏–µ,–°—Ç—Ä–∞–Ω–∞,–ê–¥—Ä–µ—Å
0,Alfreds Futterkiste,Germany,Obere Str. 57
1,Blauer See Delikatessen,Germany,Forsterstr. 57
2,Blondel p√®re et fils,France,"24, place Kl√©ber"
3,B√≥lido Comidas preparadas,Spain,"C/ Araquil, 67"
4,Bon app',France,"12, rue des Bouchers"
5,Drachenblut Delikatessend,Germany,Walserweg 21
6,Du monde entier,France,"67, rue des Cinquante Otages"
7,FISSA Fabrica Inter. Salchichas S.A.,Spain,"C/ Moralzarzal, 86"
8,Folies gourmandes,France,"184, chauss√©e de Tournai"
9,Frankenversand,Germany,Berliner Platz 43
10,France restauration,France,"54, rue Royale"
11,K√∂niglich Essen,Germany,Maubelstr. 90
12,La corne d'abondance,France,"67, avenue de l'Europe"
13,La maison d'Asie,France,1 rue Alsace-Lorraine
14,Lehmanns Marktstand,Germany,Magazinweg 7
15,Morgenstern Gesundkost,Germany,Heerstr. 22
16,Ottilies K√§seladen,Germany,Mehrheimerstr. 369
17,Paris sp√©cialit√©s,France,"265, boulevard Charonne"
18,QUICK-Stop,Germany,Taucherstra√üe 10
19,Romero y tomillo,Spain,"Gran V√≠a, 1"
20,Sp√©cialit√©s du monde,France,"25, rue Lauriston"
21,Toms Spezialit√§ten,Germany,Luisenstr. 48
22,Victuailles en stock,France,"2, rue du Commerce"
23,Vins et alcools Chevalier,France,59 rue de l'Abbaye
24,Die Wandernde Kuh,Germany,Adenauerallee 900

**_2. –í—ã–±–µ—Ä–∏—Ç–µ —Ç–æ–ø 3 —Å—Ç—Ä–∞–Ω—ã –ø–æ –∫–æ–ª–∏—á–µ—Å—Ç–≤—É –∑–∞–∫–∞–∑—á–∏–∫–æ–≤, –≤—ã–≤–µ–¥–∏—Ç–µ –∏—Ö –Ω–∞–∑–≤–∞–Ω–∏—è –∏ –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ –∑–∞–ø–∏—Å–µ–π._**

In [256]:
tasks+=1
pd.read_sql(
    '''
    SELECT Country AS –°—Ç—Ä–∞–Ω–∞, 
    COUNT(Country) AS –ö–æ–ª–∏—á–µ—Å—Ç–≤–æ_–∑–∞–ø–∏—Å–µ–π 
    FROM Customers
    GROUP BY Country
    ORDER BY –ö–æ–ª–∏—á–µ—Å—Ç–≤–æ_–∑–∞–ø–∏—Å–µ–π DESC
    LIMIT 3
    ''',
    con, 
)

    –°—Ç—Ä–∞–Ω–∞  –ö–æ–ª–∏—á–µ—Å—Ç–≤–æ_–∑–∞–ø–∏—Å–µ–π
0      USA                  13
1  Germany                  11
2   France                  11

**_3. –í—ã–±–µ—Ä–∏—Ç–µ –ø–µ—Ä–µ–≤–æ–∑—á–∏–∫–∞, –∫–æ—Ç–æ—Ä—ã–π –æ—Ç–ø—Ä–∞–≤–∏–ª 10-–π –ø–æ –≤—Ä–µ–º–µ–Ω–∏ –∑–∞–∫–∞–∑, –≤—ã–≤–µ–¥–∏—Ç–µ –µ–≥–æ –Ω–∞–∑–≤–∞–Ω–∏–µ, –∏ –¥–∞—Ç—É –æ—Ç–ø—Ä–∞–≤–ª–µ–Ω–∏—è._**

In [257]:
tasks+=1
pd.read_sql(
    '''
     SELECT –ù–∞–∑–≤–∞–Ω–∏–µ_–ø–µ—Ä–µ–≤–æ–∑—á–∏–∫–∞,
            MAX(–î–∞—Ç–∞) AS –î–∞—Ç–∞
     FROM(
          SELECT ShipperName AS –ù–∞–∑–≤–∞–Ω–∏–µ_–ø–µ—Ä–µ–≤–æ–∑—á–∏–∫–∞, 
                OrderDate AS –î–∞—Ç–∞
          FROM Shippers 
               JOIN Orders USING(ShipperID)
          ORDER BY OrderID
          LIMIT 10
          )
    ''', 
    con, 
)

  –ù–∞–∑–≤–∞–Ω–∏–µ_–ø–µ—Ä–µ–≤–æ–∑—á–∏–∫–∞        –î–∞—Ç–∞
0     Federal Shipping  16.07.1996

**_4. –í—ã–±–µ—Ä–∏—Ç–µ —Å–∞–º—ã–π –¥–æ—Ä–æ–≥–æ–π –∑–∞–∫–∞–∑, –≤—ã–≤–µ–¥–∏—Ç–µ —Å–ø–∏—Å–æ–∫ —Ç–æ–≤–∞—Ä–æ–≤ —Å –∏—Ö —Ü–µ–Ω–∞–º–∏._**

In [258]:
tasks+=1
pd.read_sql(
    '''     
        WITH table_1 AS 
        (SELECT MAX(Sum_Price) AS Max_Sum,
                OrderID
        FROM (
              SELECT OrderID, 
              SUM(Price) AS Sum_Price
              FROM OrderDetails
                   JOIN Products USING(ProductID)
              GROUP BY OrderID
              ORDER BY SUM(Price) DESC
              )
         )
         
        SELECT OrderDetails.OrderID AS N_–∑–∞–∫–∞–∑–∞,
               ProductName AS –°–ø–∏—Å–æ–∫_—Ç–æ–≤–∞—Ä–æ–≤,
               Price AS –¶–µ–Ω–∞
        FROM table_1 
             JOIN OrderDetails USING(OrderID)
             JOIN Products ON OrderDetails.ProductID=Products.ProductID
      
                                         
    ''',
    con,
)

   N_–∑–∞–∫–∞–∑–∞           –°–ø–∏—Å–æ–∫_—Ç–æ–≤–∞—Ä–æ–≤    –¶–µ–Ω–∞
0     10360        R√∂ssle Sauerkraut   45.60
1     10360  Th√ºringer Rostbratwurst  123.79
2     10360            C√¥te de Blaye  263.50
3     10360                 Maxilaku   20.00
4     10360                Tourti√®re    7.45

**_5. –ö–∞–∫–æ–π —Ç–æ–≤–∞—Ä –±–æ–ª—å—à–µ –≤—Å–µ–≥–æ –∑–∞–∫–∞–∑—ã–≤–∞–ª–∏ –ø–æ –∫–æ–ª–∏—á–µ—Å—Ç–≤—É –µ–¥–∏–Ω–∏—Ü —Ç–æ–≤–∞—Ä–∞, –≤—ã–≤–µ–¥–∏—Ç–µ –µ–≥–æ –Ω–∞–∑–≤–∞–Ω–∏–µ –∏ –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ –µ–¥–∏–Ω–∏—Ü –≤ –∫–∞–∂–¥–æ–º –∏–∑ –∑–∞–∫–∞–∑–æ–≤._**

In [259]:
tasks+=1
pd.read_sql(
    '''
       WITH table_1 AS
         (SELECT ProductID,MAX(–ö–æ–ª–∏—á–µ—Å—Ç–≤–æ) AS Max,–ù–∞–∑–≤–∞–Ω–∏–µ_—Ç–æ–≤–∞—Ä–∞
          FROM(
             SELECT ProductName AS –ù–∞–∑–≤–∞–Ω–∏–µ_—Ç–æ–≤–∞—Ä–∞, 
             SUM(Quantity) AS –ö–æ–ª–∏—á–µ—Å—Ç–≤–æ,
             Products.ProductID
             FROM OrderDetails
                  JOIN Products USING(ProductID)
             GROUP BY ProductID  
             ORDER BY –ö–æ–ª–∏—á–µ—Å—Ç–≤–æ DESC
             
             )
          )
           SELECT –ù–∞–∑–≤–∞–Ω–∏–µ_—Ç–æ–≤–∞—Ä–∞,OrderID AS N_–∑–∞–∫–∞–∑–∞,Quantity AS –ö–æ–ª–∏—á–µ—Å—Ç–≤–æ_–µ–¥–∏–Ω–∏—Ü
           FROM table_1 
               JOIN OrderDetails USING(ProductID)
               JOIN Products ON OrderDetails.ProductID=Products.ProductID
           ORDER BY –ö–æ–ª–∏—á–µ—Å—Ç–≤–æ_–µ–¥–∏–Ω–∏—Ü DESC
       
    ''',
    con,
)

      –ù–∞–∑–≤–∞–Ω–∏–µ_—Ç–æ–≤–∞—Ä–∞  N_–∑–∞–∫–∞–∑–∞  –ö–æ–ª–∏—á–µ—Å—Ç–≤–æ_–µ–¥–∏–Ω–∏—Ü
0   Gorgonzola Telino     10359                 70
1   Gorgonzola Telino     10390                 60
2   Gorgonzola Telino     10342                 56
3   Gorgonzola Telino     10376                 42
4   Gorgonzola Telino     10272                 40
5   Gorgonzola Telino     10393                 32
6   Gorgonzola Telino     10356                 30
7   Gorgonzola Telino     10374                 30
8   Gorgonzola Telino     10335                 25
9   Gorgonzola Telino     10253                 20
10  Gorgonzola Telino     10363                 20
11  Gorgonzola Telino     10273                 15
12  Gorgonzola Telino     10423                 14
13  Gorgonzola Telino     10325                  4

**_6.–í—ã–≤–µ–¥–∏—Ç–µ —Ç–æ–ø 5 –ø–æ—Å—Ç–∞–≤—â–∏–∫–æ–≤ –ø–æ –∫–æ–ª–∏—á–µ—Å—Ç–≤—É –∑–∞–∫–∞–∑–æ–≤, –≤—ã–≤–µ–¥–∏—Ç–µ –∏—Ö –Ω–∞–∑–≤–∞–Ω–∏—è, —Å—Ç—Ä–∞–Ω—É, –∫–æ–Ω—Ç–∞–∫—Ç–Ω–æ–µ –ª–∏—Ü–æ –∏ —Ç–µ–ª–µ—Ñ–æ–Ω._**

In [260]:
tasks+=1
pd.read_sql(
     '''
       SELECT 
       SupplierName AS –ü–æ—Å—Ç–∞–≤—â–∏–∫,
       Country AS –°—Ç—Ä–∞–Ω–∞,
       ContactName AS –ö–æ–Ω—Ç–∞–∫—Ç–Ω–æ–µ_–ª–∏—Ü–æ,
       Phone AS –¢–µ–ª–µ—Ñ–æ–Ω, 
       SUM(Quantity) AS –ö–æ–ª–∏—á–µ—Å—Ç–≤–æ_–∑–∞–∫–∞–∑–æ–≤
       
       FROM Products
            JOIN Suppliers USING(SupplierID)
            JOIN OrderDetails USING(ProductID)
            
       GROUP BY SupplierID
       ORDER BY –ö–æ–ª–∏—á–µ—Å—Ç–≤–æ_–∑–∞–∫–∞–∑–æ–≤ DESC
       LIMIT 5
      
      ''',
    con,
)

,–ü–æ—Å—Ç–∞–≤—â–∏–∫,–°—Ç—Ä–∞–Ω–∞,–ö–æ–Ω—Ç–∞–∫—Ç–Ω–æ–µ_–ª–∏—Ü–æ,–¢–µ–ª–µ—Ñ–æ–Ω,–ö–æ–ª–∏—á–µ—Å—Ç–≤–æ_–∑–∞–∫–∞–∑–æ–≤
0,"Pavlova, Ltd.",Australia,Ian Devling,(03) 444-2343,1148
1,Norske Meierier,Norway,Beate Vileid,(0)2-953010,836
2,Formaggi Fortini s.r.l.,Italy,Elio Rossi,(0544) 60323,780
3,Gai p√¢turage,France,Eliane Noz,38.76.98.06,776
4,Plutzer Lebensmittelgro√üm√§rkte AG,Germany,Martin Bein,(069) 992755,776

**_7. –ö–∞–∫—É—é –∫–∞—Ç–µ–≥–æ—Ä–∏—é —Ç–æ–≤–∞—Ä–æ–≤ –∑–∞–∫–∞–∑—ã–≤–∞–ª–∏ –±–æ–ª—å—à–µ –≤—Å–µ–≥–æ –ø–æ —Å—Ç–æ–∏–º–æ—Å—Ç–∏ –≤ –ë—Ä–∞–∑–∏–ª–∏–∏, –≤—ã–≤–µ–¥–∏—Ç–µ —Å—Ç—Ä–∞–Ω—É, –Ω–∞–∑–≤–∞–Ω–∏–µ –∫–∞—Ç–µ–≥–æ—Ä–∏–∏ –∏ —Å—É–º–º—É._**

In [261]:
tasks+=1
pd.read_sql(
     '''
       SELECT –°—Ç—Ä–∞–Ω–∞,–ö–∞—Ç–µ–≥–æ—Ä–∏—è,MAX(–°—É–º–º–∞) AS –°—É–º–º–∞
       FROM(
            SELECT Country as –°—Ç—Ä–∞–Ω–∞,
            CategoryName AS –ö–∞—Ç–µ–≥–æ—Ä–∏—è,
            SUM(Price) AS –°—É–º–º–∞
            FROM Products 
               JOIN Categories USING(CategoryID)
               JOIN OrderDetails USING(ProductID)
               JOIN Orders ON OrderDetails.OrderID=Orders.OrderID
               JOIN Customers ON Orders.CustomerID=Customers.CustomerID
            WHERE Country='Brazil'
            GROUP BY CategoryName
            ORDER BY –°—É–º–º–∞ DESC
            )
      ''',
    con,
)

   –°—Ç—Ä–∞–Ω–∞  –ö–∞—Ç–µ–≥–æ—Ä–∏—è   –°—É–º–º–∞
0  Brazil  Beverages  405.75

**_8.–ö–∞–∫–∞—è —Ä–∞–∑–Ω–∏—Ü–∞ –≤ —Å—Ç–æ–∏–º–æ—Å—Ç–∏ –º–µ–∂–¥—É —Å–∞–º—ã–º –¥–æ—Ä–æ–≥–∏–º –∏ —Å–∞–º—ã–º –¥–µ—à–µ–≤—ã–º –∑–∞–∫–∞–∑–æ–º –∏–∑ –°–®–ê._**

In [262]:
tasks+=1
pd.read_sql(
     '''
       SELECT MAX(–°—Ç–æ–∏–º–æ—Å—Ç—å_–∑–∞–∫–∞–∑–∞)-MIN(–°—Ç–æ–∏–º–æ—Å—Ç—å_–∑–∞–∫–∞–∑–∞) AS –†–∞–∑–Ω–∏—Ü–∞
       FROM(
            SELECT SUM(Price) AS –°—Ç–æ–∏–º–æ—Å—Ç—å_–∑–∞–∫–∞–∑–∞
            FROM Products 
               JOIN Categories USING(CategoryID)
               JOIN OrderDetails USING(ProductID)
               JOIN Orders ON OrderDetails.OrderID=Orders.OrderID
               JOIN Customers ON Orders.CustomerID=Customers.CustomerID
            WHERE Country='USA'
            GROUP BY OrderDetails.OrderID
            ORDER BY SUM(Price) DESC
            )
      ''',
    con,
)

   –†–∞–∑–Ω–∏—Ü–∞
0   334.09

**_9.–í—ã–≤–µ–¥–∏—Ç–µ –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ –∑–∞–∫–∞–∑–æ–≤ —É –∫–∞–∂–¥–æ–≥–æ –∏—Ö —Ç—Ä–µ—Ö —Å–∞–º—ã—Ö –º–æ–ª–æ–¥—ã—Ö —Å–æ—Ç—Ä—É–¥–Ω–∏–∫–æ–≤, –∞ —Ç–∞–∫–∂–µ –∏–º—è –∏ —Ñ–∞–º–∏–ª–∏—é –≤–æ –≤—Ç–æ—Ä–æ–π –∫–æ–ª–æ–Ω–∫–µ._**

In [263]:
tasks+=1
pd.read_sql(
    '''
             SELECT 
             COUNT(OrderID) AS –ö–æ–ª–∏—á–µ—Å—Ç–≤–æ_–∑–∞–∫–∞–∑–æ–≤,
             FirstName||' '|| LastName AS –ò–º—è_–§–∞–º–∏–ª–∏—è
            
             FROM Orders
                  JOIN OrderDetails USING(OrderID)
                  JOIN Employees USING(EmployeeID)
             GROUP BY EmployeeID
             ORDER BY substr(BirthDate, length(BirthDate)-4) DESC,substr(BirthDate, length(BirthDate)-7) DESC
             LIMIT 3
             
    ''',
    con, 
)

   –ö–æ–ª–∏—á–µ—Å—Ç–≤–æ_–∑–∞–∫–∞–∑–æ–≤      –ò–º—è_–§–∞–º–∏–ª–∏—è
0                  19   Anne Dodsworth
1                  78    Nancy Davolio
2                  74  Janet Leverling

**_10.–°–∫–æ–ª—å–∫–æ –±–∞–Ω–æ–∫ –∫—Ä–∞–±–æ–≤–æ–≥–æ –º—è—Å–∞ –≤—Å–µ–≥–æ –±—ã–ª–æ –∑–∞–∫–∞–∑–∞–Ω–æ._**

In [266]:
tasks+=1
pd.read_sql(
    '''
             SELECT SUM(Quantity) AS –í—Å–µ–≥–æ_–±–∞–Ω–æ–∫
            
             FROM Products
                  JOIN OrderDetails USING(ProductID)
             WHERE ProductName LIKE '%Crab%'
             
    ''',
    con, 
)

   –í—Å–µ–≥–æ_–±–∞–Ω–æ–∫
0          256

In [265]:
if tasks==10:
    print('–í—ã–ø–æ–ª–Ω–µ–Ω—ã –≤—Å–µ –∑–∞–¥–∞–Ω–∏—è üôÇ')
else:
    print('–í—ã–ø–æ–ª–Ω–µ–Ω—ã –Ω–µ –≤—Å–µ –∑–∞–¥–∞–Ω–∏—è! üôÄ')

–í—ã–ø–æ–ª–Ω–µ–Ω—ã –≤—Å–µ –∑–∞–¥–∞–Ω–∏—è üôÇ